snlkuharlocal/src/Documents/Матрица/Матрица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Матрица</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтсрочкаПлатежа</name>
    <type>
      <types>CatalogRef.ОтсрочкиПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеРазрешено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборПечатныхФорм</name>
    <type>
      <types>CatalogRef.НаборыПечатныхФорм</types>
    </type>
  </attributes>
  <attributes>
    <name>МакетЭтикетки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостояннаяАкция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСкановДоговоров</name>
    <type>
      <types>EnumRef.СостоянияСкановДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийСБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатрицы</name>
    <type>
      <types>CatalogRef.ВидМатрицы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ШККонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АртикулКонтрагента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПосредника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этикетка1</name>
      <type>
        <types>CatalogRef.НастройкиПечатиЭтикеток</types>
      </type>
    </attributes>
    <attributes>
      <name>Этикетка2</name>
      <type>
        <types>CatalogRef.НастройкиПечатиЭтикеток</types>
      </type>
    </attributes>
    <attributes>
      <name>Этикетка3</name>
      <type>
        <types>CatalogRef.НастройкиПечатиЭтикеток</types>
      </type>
    </attributes>
    <attributes>
      <name>Этикетка4</name>
      <type>
        <types>CatalogRef.НастройкиПечатиЭтикеток</types>
      </type>
    </attributes>
    <attributes>
      <name>Этикетка5</name>
      <type>
        <types>CatalogRef.НастройкиПечатиЭтикеток</types>
      </type>
    </attributes>
    <attributes>
      <name>ШККонтрагентаБлочок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШККонтрагентаКоробка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КратностьКоробки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеКонтрагента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПроизводителяКонтрагента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШКСпайки</name>
      <comment>Для свертки в спайки при выгрузке в екод (Тандер 7 континент и т.д.)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипУпаковки</name>
      <type>
        <types>CatalogRef.ТипыУпаковки</types>
      </type>
    </attributes>
    <attributes>
      <name>КолКоробовВСлое</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВысотаПаллета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШККонтрагентаДополнительный</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйОстатокКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйОстатокВДнях</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеБрендаДляКонтрагента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЦветаДляКонтрагента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеРазмераДляКонтрагента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТовараДляКонтрагента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПороговаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КратностьПаллеты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособПоставки</name>
      <type>
        <types>EnumRef.СпособПоставкиКонтрагенту</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыделятьВДокументах</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставки</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокУчастияВАкции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выгружать0Ост</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРаботыСМаркировкой</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаПродаж</name>
      <comment>изм.0000000148</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыДопОбработок</name>
    <attributes>
      <name>ДопОбработка</name>
      <type>
        <types>CatalogRef.ВидыДопОбработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>ExchangePlanRef.Основной</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПунктыДоставки</name>
    <attributes>
      <name>ПунктДоставки</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сканы</name>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаДобавления</name>
      <type>
        <types>CatalogRef.ПричиныДобавленияСканов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязательноДобавлениеСкана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерХранения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/ТипУзлаИБ/ТипУзлаИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУзлаИБ</name>
  <enumValues>
    <name>ИнтегральнаяИБ</name>
  </enumValues>
  <enumValues>
    <name>УправляющееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ТорговоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/Матрица/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда 
		
		ТекМатрицаНаКомплектующие = Документы.Матрица.ОпределитьМатрицуНаКомплектующие(Ссылка);
		
		Если ЗначениеЗаполнено(ТекМатрицаНаКомплектующие) Тогда
			
			Запрос = Новый Запрос;
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	МатрицаТовары.Номенклатура КАК НоменклатураКомплект,
			               |	МатрицаТовары.ШККонтрагента КАК ШККонтрагента,
			               |	МатрицаТовары.ДатаНачалаРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой
			               |ПОМЕСТИТЬ ВТ_МатрицаКомплекты
			               |ИЗ
			               |	Документ.Матрица.Товары КАК МатрицаТовары
			               |ГДЕ
			               |	МатрицаТовары.ДатаНачалаРаботыСМаркировкой <> ДАТАВРЕМЯ(1, 1, 1)
			               |	И МатрицаТовары.Номенклатура.Родитель.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
			               |	И МатрицаТовары.Ссылка = &Ссылка
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_МатрицаКомплекты.НоменклатураКомплект КАК НоменклатураКомплект,
			               |	ВТ_МатрицаКомплекты.ШККонтрагента КАК ШККонтрагента,
			               |	ВТ_МатрицаКомплекты.ДатаНачалаРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой,
			               |	НоменклатураКоплектующие.Номенклатура КАК Комплектующая
			               |ИЗ
			               |	ВТ_МатрицаКомплекты КАК ВТ_МатрицаКомплекты
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
			               |		ПО ВТ_МатрицаКомплекты.НоменклатураКомплект = НоменклатураКоплектующие.Ссылка
			               |ГДЕ
			               |	НоменклатураКоплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			Результат = Запрос.Выполнить();
			
			Если Не Результат.Пустой() Тогда
				
				ТекМатрицаНаКомплектующиеОбъект = ТекМатрицаНаКомплектующие.ПолучитьОбъект();
				
				ТекстОповещения = "Проверить корректность строк матрицы на комплектующие:" + Символы.ПС;
				
				Выборка = Результат.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					СтруктураОтбора = Новый Структура("Номенклатура", Выборка.Комплектующая);
					
					СтрокиНоменклатуры = ТекМатрицаНаКомплектующиеОбъект.Товары.НайтиСтроки(СтруктураОтбора);
					
					Если СтрокиНоменклатуры.Количество() = 0 Тогда
						
						НовСтр = ТекМатрицаНаКомплектующиеОбъект.Товары.Добавить();
						
						НовСтр.Номенклатура = Выборка.Комплектующая;
						НовСтр.ДатаНачалаРаботыСМаркировкой = Выборка.ДатаНачалаРаботыСМаркировкой;
						
						ТекстОповещения = ТекстОповещения + "Строка: " + НовСтр.НомерСтроки + "; Номенклатура: " + НовСтр.Номенклатура 
						+ "; Дата начала работы с маркировкой: " + Формат(НовСтр.ДатаНачалаРаботыСМаркировкой, "ДЛФ=Д") + Символы.ПС;
						
					Иначе
						
						Для Каждого Стр Из СтрокиНоменклатуры Цикл
							
							Если Не ЗначениеЗаполнено(Стр.ДатаНачалаРаботыСМаркировкой) Тогда
								
								Стр.ДатаНачалаРаботыСМаркировкой = Выборка.ДатаНачалаРаботыСМаркировкой;
								
								ТекстОповещения = ТекстОповещения + "Строка: " + Стр.НомерСтроки + "; Номенклатура: " + Стр.Номенклатура 
								+ "; Дата начала работы с маркировкой: " + Формат(Стр.ДатаНачалаРаботыСМаркировкой, "ДЛФ=Д") + Символы.ПС;
								
							КонецЕсли;
							
							Если Стр.ДатаНачалаРаботыСМаркировкой <> Выборка.ДатаНачалаРаботыСМаркировкой Тогда
								
								ТекстОповещения = ТекстОповещения + "Строка: " + Стр.НомерСтроки + "; Номенклатура: " + Стр.Номенклатура 
								+ "; Дата начала работы с маркировкой: " + Формат(Стр.ДатаНачалаРаботыСМаркировкой, "ДЛФ=Д") + Символы.ПС;
								
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЦикла;
				
				#Если Клиент Тогда
					
					Если ТекстОповещения <> "Проверить корректность строк матрицы на комплектующие:" + Символы.ПС Тогда
						
						Сообщить(ТекстОповещения);
						
					КонецЕсли;
					
				#КонецЕсли
				
				Попытка
					
					ТекМатрицаНаКомплектующиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
					
				Исключение
					
					#Если Клиент Тогда
						
						Сообщить(ОписаниеОшибки());
						
					#КонецЕсли
					
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	// Кельманов А.В. - ASU-2019 - 2025.02.12 }
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	// Шворобей ВЮ 22.01.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2576
	#Если Клиент Тогда
		
		Если ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(Договор) Тогда
			Если Договор.Владелец <> Контрагент Тогда
				Сообщить("Не совпадает Контрагент и владелец Договора!!!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если ПунктыДоставки.Количество() > 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ПунктыДоставки", ПунктыДоставки.Выгрузить());
			Запрос.УстановитьПараметр("Контрагент", Контрагент);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ВЫРАЗИТЬ(ПунктыДоставки.ПунктДоставки КАК Справочник.ПунктыДоставки) КАК ПунктДоставки
			|ПОМЕСТИТЬ ВремТЗ
			|ИЗ
			|	&ПунктыДоставки КАК ПунктыДоставки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВремТЗ.ПунктДоставки КАК ПунктДоставки,
			|	ВремТЗ.ПунктДоставки.Владелец КАК Владелец
			|ПОМЕСТИТЬ ТЗПунктыДоставкиВсе
			|ИЗ
			|	ВремТЗ КАК ВремТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТЗПунктыДоставкиВсе.ПунктДоставки КАК ПунктДоставки,
			|	ТЗПунктыДоставкиВсе.Владелец КАК Владелец
			|ПОМЕСТИТЬ ТЗОшибкаВладельца
			|ИЗ
			|	ТЗПунктыДоставкиВсе КАК ТЗПунктыДоставкиВсе
			|ГДЕ
			|	ТЗПунктыДоставкиВсе.Владелец <> &Контрагент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КОЛИЧЕСТВО(ТЗОшибкаВладельца.Владелец) КАК Владелец
			|ИЗ
			|	ТЗОшибкаВладельца КАК ТЗОшибкаВладельца";
			
			УстановитьПривилегированныйРежим(Истина);
			МассивПакета = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
			УстановитьПривилегированныйРежим(Ложь);
			
			ПунктыДоставкиСОшибкой = МассивПакета[2].Выгрузить();
			Если ПунктыДоставкиСОшибкой.Количество() <> 0 Тогда
				
				Для Каждого Стр ИЗ ПунктыДоставкиСОшибкой Цикл
					Сообщить("Не совпадает Владелец " + Строка(Стр.Владелец) + " у Пункта Доставки " +
					Строка(Стр.ПунктДоставки) + " и Контрагент!!!");
				КонецЦикла;
				Отказ = Истина;
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	#КонецЕсли
	// Шворобей ВЮ 22.01.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2576
	
	ЕстьИзменения		=Модифицированность();	
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	//Кухарь 17.02.16 начало
	//Выгрузка матриц из филиалов в ЦО
	если ОбменДанными.Загрузка и ПараметрыСеанса.ЭтотУзел.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда
		НужноВыгружать=ложь;
	КонецЕсли;
	//Кухарь 17.02.16 конец
	
	
     Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;
	
	// Ихсанов Д. А. Начало 12.11.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-7808
	МатрицаПоFBS = Ложь;
	Для каждого СтрокаТабличнойЧасти из ПунктыДоставки Цикл
		Если ОбменМаркетПлейс.КонтрагентУчастникМаркетПлейса(Контрагент, СтрокаТабличнойЧасти.ПунктДоставки) Тогда
			МатрицаПоFBS = Истина;
			Прервать
		КонецЕсли;
	КонецЦикла;
	
	Если МатрицаПоFBS Тогда
		ТекстыСообщений = Новый Массив;
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	НоменклатураДанные.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Матрица.Товары КАК МатрицаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураДанные
		|		ПО МатрицаТовары.Номенклатура = НоменклатураДанные.Ссылка
		|ГДЕ
		|	МатрицаТовары.Ссылка = &Ссылка
		|	И НоменклатураДанные.ВидКомплекта В (ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект), ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект))
		|	И НоменклатураДанные.ГТИН = """"");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Номенклатура", Выборка.Ссылка);
			
			НайденныеСтроки = Товары.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Для каждого СтрокаТабличнойЧасти из НайденныеСтроки Цикл
				СтрокаТабличнойЧасти.Выгружать0Ост = Истина;
			КонецЦикла;
			
			ТекстыСообщений.Добавить(СтрШаблон("Не заполнен GTIN по номенклатуре %1. Выгрузка остатков по ней производиться не будет",
				Выборка.Ссылка));
		КонецЦикла;
		
		// Ихсанов Д. А. Начало 18.02.2026 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2716
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВЫРАЗИТЬ(МатрицаТовары.АртикулКонтрагента КАК СТРОКА(128)) КАК АртикулКонтрагента,
		|	МатрицаТовары.НомерСтроки КАК НомерСтроки,
		|	МатрицаТовары.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ вт_ДанныеПолейИдентификаторовМатрицы
		|ИЗ
		|	&ТаблицаДанных КАК МатрицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ДанныеПолейИдентификаторовМатрицы.АртикулКонтрагента КАК Идентификатор,
		|	КОЛИЧЕСТВО(вт_ДанныеПолейИдентификаторовМатрицы.Номенклатура) КАК КоличествоИдентификаторов,
		|	""АртикулКонтрагента"" КАК ТипИдентификатора
		|ПОМЕСТИТЬ вт_ДанныеПоДублям
		|ИЗ
		|	вт_ДанныеПолейИдентификаторовМатрицы КАК вт_ДанныеПолейИдентификаторовМатрицы
		|ГДЕ
		|	вт_ДанныеПолейИдентификаторовМатрицы.АртикулКонтрагента <> """"
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ДанныеПолейИдентификаторовМатрицы.АртикулКонтрагента
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(вт_ДанныеПолейИдентификаторовМатрицы.Номенклатура) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ДанныеПоДублям.Идентификатор КАК Идентификатор,
		|	вт_ДанныеПоДублям.КоличествоИдентификаторов КАК КоличествоИдентификаторов,
		|	вт_ДанныеПоДублям.ТипИдентификатора КАК ТипИдентификатора,
		|	вт_ДанныеПолейИдентификаторовМатрицы.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	вт_ДанныеПоДублям КАК вт_ДанныеПоДублям
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ДанныеПолейИдентификаторовМатрицы КАК вт_ДанныеПолейИдентификаторовМатрицы
		|		ПО вт_ДанныеПоДублям.Идентификатор = вт_ДанныеПолейИдентификаторовМатрицы.АртикулКонтрагента
		|ИТОГИ
		|	МАКСИМУМ(КоличествоИдентификаторов),
		|	МАКСИМУМ(ТипИдентификатора)
		|ПО
		|	Идентификатор");
		Запрос.УстановитьПараметр("ТаблицаДанных", Товары.Выгрузить());
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка.Следующий() Цикл
				МассивНомеровСтрок = Новый Массив;
				ВыборкаДетальныеЗаписи = Выборка.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					МассивНомеровСтрок.Добавить(ВыборкаДетальныеЗаписи.НомерСтроки);
				КонецЦикла;
				
				ТекстыСообщений.Добавить(СтрШаблон("Обнаружены дубли поля %1, в количестве %2 шт по значению %3! Номера строк: %4.",
					Выборка.ТипИдентификатора, Выборка.КоличествоИдентификаторов, СокрЛП(Выборка.Идентификатор),
					СтрСоединить(МассивНомеровСтрок, ", ")))
			КонецЦикла;
		КонецЕсли;
		// Ихсанов Д. А. Конец  18.02.2026
		
		СообщитьИзМодуля(СтрСоединить(ТекстыСообщений, Символы.ПС));
	КонецЕсли;
	// Ихсанов Д. А. Конец  12.11.2025
	
КонецПроцедуры
